app/views/registers/power.html.erb

<ul>
    <% Register.all.each do |ip| %>
---
SELECT "registers".* FROM "registers"

<p>
Actualmente hay <%= Register.count %> IPs registradas
---
SELECT COUNT(*) FROM "registers"