app/controllers/registers_controller.rb

    def register
        @register = Register.new(ip: request.remote_ip)
        @register.save
---
INSERT INTO "registers" ("ip", "created_at", "updated_at") VALUES (?, ?, ?)  [["ip", "127.0.0.1"], ["created_at", "2017-11-05 21:56:29.998730"], ["updated_at", "2017-11-05 21:56:29.998730"]]

    def power
        @ips = []
        10.times do |i|
            rg = Random.new
            number = rg.rand(1..Register.count)
            if (number = 0)
                number = 1
            end
            ip = Register.find(number)
---
SELECT COUNT(*) FROM "registers"
SELECT  "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]